Assignment4/artillery/artillery-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 50
  processor: "./payloadCreator.js"
scenarios:
  - flow:
    - function: "createBody"
    - post:
        url: "/mean"
        json: 
          data: "{{data}}"
          filterGranularity: "{{filterGranularity}}"