Assignment4/artillery/artillery-test.yml
config:
  target: 'http://192.168.1.161:3000'
  phases:
    - duration: 60 # test duration
      arrivalRate: 10 # Number of new users every sec
  processor: "./geoData.js"
scenarios:
  - name: "Mean API test"
    weight: 50 # Average 50% of users
    flow:
      - loop:
          - post:
              url: "/mean"
              beforeRequest: setJSONBody
        count: 100
  - name: "Median API test"
    weight: 50 # Average 50% of users
    flow:
      - loop:
          - post:
              url: "/median"
              beforeRequest: setJSONBody
        count: 100